; domain
(define (domain blocks)
  (:requirements :strips :typing)

  (:types block) 

  (:predicates
  (clear ?x - block)
  (on-table ?x - block)
  (holding ?x - block)
  (handempty) 
  (on ?x - block ?y - block)
)




  ;; Action to pick up a block from the table
  (:action pick-up
    :parameters (?x - block)
    :precondition (and (clear ?x) (on-table ?x) (handempty))
    :effect (and (holding ?x) (not (clear ?x)) (not (on-table ?x)) (not (handempty)))
  )

  ;; Action to put down a block on the table
  (:action put-down
    :parameters (?x - block)
    :precondition (holding ?x)
    :effect (and (on-table ?x) (clear ?x) (handempty) (not (holding ?x)))
  )

  ;; Action to stack a block on another block
  (:action stack
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (on ?x ?y) (clear ?x) (handempty) (not (holding ?x)) (not (clear ?y)))
  )

  ;; Action to unstack a block from another block
  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition (and (on ?x ?y) (clear ?x) (handempty))
    :effect (and (holding ?x) (clear ?y) (not (on ?x ?y)) (not (handempty)) (not (clear ?x)))
  )
)

; problem
(define (problem blocks-problem)
  (:domain blocks)

  (:objects blockA blockB blockC blockD - block)  ;; Ensure type is correct

  (:init 
    (on-table blockA) 
    (on-table blockB) 
    (on-table blockC) 
    (on-table blockD) 
    (clear blockA) 
    (clear blockB) 
    (clear blockC) 
    (clear blockD) 
    (handempty)
  )

  (:goal 
    (and 
      (on blockA blockB) 
      (on blockB blockC) 
      (on blockC blockD)
    )
  )
)

; plan
1. (pick-up blockc)
   deleted: (clear blockc) (on-table blockc) (handempty)
   added: (holding blockc)
   goals met: 0 of 3
2. (stack blockc blockd)
   deleted: (holding blockc) (clear blockd)
   added: (on blockc blockd) (clear blockc) (handempty)
   goals met: 1 of 3
3. (pick-up blockb)
   deleted: (clear blockb) (on-table blockb) (handempty)
   added: (holding blockb)
   goals met: 1 of 3
4. (stack blockb blockc)
   deleted: (holding blockb) (clear blockc)
   added: (on blockb blockc) (clear blockb) (handempty)
   goals met: 2 of 3
5. (pick-up blocka)
   deleted: (clear blocka) (on-table blocka) (handempty)
   added: (holding blocka)
   goals met: 2 of 3
6. (stack blocka blockb)
   deleted: (holding blocka) (clear blockb)
   added: (on blocka blockb) (clear blocka) (handempty)
   goals met: 3 of 3
